---
kind: property
id: P:Autodesk.Revit.DB.RevitLinkType.IsNestedLink
source: html/cae32f75-fc08-8625-650a-dc6427d3b985.htm
---
# Autodesk.Revit.DB.RevitLinkType.IsNestedLink Property

Indicates whether this link is a nested or top-level link.

## Syntax (C#)
```csharp
public bool IsNestedLink { get; }
```